In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [8]:
string_data.fillna('Rahul')

0        Rahul
1    artichoke
2        Rahul
3      avocado
dtype: object

In [10]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [12]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True
3   True  False  False

In [14]:
cleaned = data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data = data.dropna(axis=1, how = 'all')

In [24]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df.iloc[:1, 0] = NA

In [32]:
df

          0         1         2
0       NaN       NaN       NaN
1  0.190971       NaN       NaN
2 -0.278928       NaN -2.441772
3 -0.818186       NaN -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [36]:
df.dropna(thresh=2)

          0         1         2
2 -0.278928       NaN -2.441772
3 -0.818186       NaN -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [37]:
df.fillna(0)

          0         1         2
0  0.000000  0.000000  0.000000
1  0.190971  0.000000  0.000000
2 -0.278928  0.000000 -2.441772
3 -0.818186  0.000000 -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [38]:
df

          0         1         2
0       NaN       NaN       NaN
1  0.190971       NaN       NaN
2 -0.278928       NaN -2.441772
3 -0.818186       NaN -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [44]:
df.fillna({0:7, 1: 0.5, 2: 0})

          0         1         2
0  7.000000  0.500000  0.000000
1  0.190971  0.500000  0.000000
2 -0.278928  0.500000 -2.441772
3 -0.818186  0.500000 -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [45]:
df

          0         1         2
0  7.000000  0.500000  0.000000
1  0.190971  0.500000  0.000000
2 -0.278928  0.500000 -2.441772
3 -0.818186  0.500000 -0.221364
4 -1.353008 -1.543607 -0.571920
5 -0.423623  0.607284 -0.128398
6  0.234834  0.183392 -0.538832

In [46]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.173721 -0.416634  0.185034
1  0.315186  2.832087 -0.378350
2  0.661267       NaN -2.106959
3  0.728466       NaN -0.097773
4 -1.202279       NaN       NaN
5  0.300626       NaN       NaN

In [48]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.173721 -0.416634  0.185034
1  0.315186  2.832087 -0.378350
2  0.661267  2.832087 -2.106959
3  0.728466  2.832087 -0.097773
4 -1.202279       NaN -0.097773
5  0.300626       NaN -0.097773

In [49]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [51]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [52]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [54]:
data['v1'] = range(7)

In [55]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [56]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [58]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [60]:
data['animal'] = lowercased.map(meat_to_animal)

In [63]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [66]:
data['animal_2'] = data['food'].map(lambda x: meat_to_animal[x.lower()])

In [71]:
data.drop('animal_2', axis=1)

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [29]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [19]:
data.index = data.index.str.upper()
data.columns = data.columns.str.upper()

In [31]:
data['one']

Ohio        0
Colorado    4
New York    8
Name: one, dtype: int32

In [32]:
data = pd.DataFrame(np.random.randn(10, 3))
data

          0         1         2
0 -1.111998 -0.527625  1.039049
1 -0.176470  0.452324  1.192635
2  0.027577  1.424849  2.673070
3 -1.437676  0.144029 -1.478135
4  0.444070  0.896869  0.909736
5 -0.057891 -0.306354 -0.821857
6 -0.465453 -1.286864  2.197693
7 -0.092560  1.432987 -0.209133
8 -0.242337 -1.956823 -0.673459
9  0.970413 -0.441270  0.182313

In [34]:
col = data[2]

In [36]:
col[np.abs(col) > 2]

2    2.673070
6    2.197693
Name: 2, dtype: float64

In [38]:
data[np.abs(data)>2] = np.sign(data) *2

In [41]:
np.sign(-31)

-1

In [42]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [47]:
sampler = np.random.permutation(5)
sampler

array([2, 3, 4, 1, 0])

In [48]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [51]:
df.sample(3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [52]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [53]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0